# Task 4.9 Part 1

## 1. Import libraries and data

## 2. General Checking

## 3. Data Wrangling

## 4. Data quality and consistency checks

# 5. Combine Data

# 6. Export data

# ---------------------------------------------------------------------------------------------------------

## 1. Import libraries and data

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Create string for the path 

path = r'C:\Users\kilia\OneDrive\CareerFoundry\Projects\Data Immersion Course\Achievement 4\Instacart Basket Analysis_04-2023\02 Data\Original Data'
path1 = r'C:\Users\kilia\OneDrive\CareerFoundry\Projects\Data Immersion Course\Achievement 4\Instacart Basket Analysis_04-2023'
path2 = r'D:\CareerFoundry\Projects\Data Immersion Course\Achievement 4\Instacart Basket Analysis_04-2023\02 Data\Prepared Data'

In [3]:
# Import Customers dataset

customers = pd.read_csv(os.path.join(path, 'customers.csv'))

In [4]:
# Import orders_products_variables_aggregated_with_flags dataset 
ords_prods_merged = pd.read_pickle(os.path.join(path1, '02 Data', 'Prepared Data', 'orders_products_variables_aggregated_with_flags.pkl'))

## 2. General Checking

In [5]:
customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
customers.shape

(206209, 10)

In [7]:
customers.describe().astype(int)

       user_id     Age  n_dependants  income
count   206209  206209        206209  206209
mean    103105      49             1   94632
std      59527      18             1   42473
min          1      18             0   25903
25%      51553      33             0   59874
50%     103105      49             1   93547
75%     154657      66             3  124244
max     206209      81             3  593901

## 3. Data Wrangling

In [8]:
# Rename Columns 

customers.rename(columns= {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'number_dependants', 'fam_status' : 'family_status'}, inplace = True)

## 4. Data quality and consistency checks

### Check for inconsistent data types

In [9]:
# Check for mixed type columns, prints all column names with mixed types 

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [12]:
# Count different values in first_name 

customers['first_name'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: first_name, Length: 208, dtype: int64

In [14]:
# Set First_Name column to string type 

customers['first_name'] = customers['first_name'].astype('str')

### Check missing vlaues

In [15]:
customers.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
state                0
age                  0
date_joined          0
number_dependants    0
family_status        0
income               0
dtype: int64

### Check for duplicates

In [16]:
# Create df with only full duplicates 

df_dups = customers[customers.duplicated()]

In [17]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_dependants, family_status, income]
Index: []

## 5. Combine Data

In [18]:
# Check the data type on the key column 

customers['user_id'].dtype

dtype('int64')

In [19]:
ords_prods_merged['user_id'].dtype

dtype('int64')

In [20]:
# Check dataframe ords_prods_merged

ords_prods_merged.shape

(32404859, 23)

In [21]:
# Merge dataframes 

df_merge = ords_prods_merged.merge(customers, on = 'user_id', indicator = True)

In [22]:
df_merge

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,first_name,last_name,gender,state,age,date_joined,number_dependants,family_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32404854,156685,106143,26,4,23,5.0,19675,1,1,Organic Raspberry Black Tea,...,Gerald,Yates,Male,Hawaii,25,5/26/2017,0,single,53755,both
32404855,484769,66343,1,6,11,NaN,47210,1,0,Fresh Farmed Tilapia Fillet,...,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151,both
32404856,1561557,66343,2,1,11,30.0,47210,1,1,Fresh Farmed Tilapia Fillet,...,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151,both
32404857,276317,66343,3,6,15,19.0,47210,1,1,Fresh Farmed Tilapia Fillet,...,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151,both
32404858,2922475,66343,4,1,12,30.0,47210,1,1,Fresh Farmed Tilapia Fillet,...,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151,both

In [23]:
df_merge['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [24]:
# Drop _merge column 

df_merge.drop('_merge', axis=1, inplace=True)

## 6. Export data

In [69]:
df_merge.to_pickle(os.path.join(path2,'dataframe_combined.pkl'))